In [50]:
import pandas as pd
import numpy as np
import os
import mysql.connector
from sqlalchemy import create_engine

In [53]:
df = pd.read_sql('test', engine)
df.head()

   idtest     name  age
0       1  Hasindu   23
1       2  Shanuka   24
2       3   Rashmi   22

In [67]:
ratings = pd.read_csv('ratings.csv', encoding = "ISO-8859-1")

In [63]:
tags = pd.read_csv('tags.csv', encoding = "ISO-8859-1")

In [65]:
to_read = pd.read_csv('to_read.csv', encoding = "ISO-8859-1")

In [68]:
book_tags = pd.read_csv('book_tags.csv', encoding = "ISO-8859-1")

In [69]:
book_tags.to_sql(name='book_tags', con=engine, if_exists='replace', index=False)

In [66]:
to_read.to_sql(name='to_read', con=engine, if_exists='replace', index=False)

In [64]:
tags.to_sql(name='tags', con=engine, if_exists='replace', index=False)

In [55]:
ratings.to_sql(name='ratings', con=engine ,if_exists='replace', index=False)

In [60]:
df1 = pd.read_sql('ratings', engine)

In [61]:
df1.head()

   book_id  user_id  rating
0        1      314       5
1        1      439       3
2        1      588       5
3        1     1169       4
4        1     1185       4

In [62]:
df1.dtypes

book_id    int64
user_id    int64
rating     int64
dtype: object

In [70]:
tags.dtypes

tag_id       int64
tag_name    object
dtype: object

In [71]:
df2 = pd.read_sql('tags', engine)

In [72]:
df2.dtypes

tag_id       int64
tag_name    object
dtype: object

In [73]:
books = pd.read_csv('books.csv', encoding = "ISO-8859-1")

In [74]:
books.to_sql(name='books', con=engine, if_exists='replace', index=False)